          01 PROD-PRICE-HISTORY.
               05 PROD-SYMB       PIC X(13).
               05 PREV-DAY-P    PIC 9(5)v9(3).
               05 LATEST-P      PIC 9(5)v9(3).
               05 END-OF-MNTH-P PIC 9(5)v9(3).
